In [209]:
import numpy as np
import pandas as pd

In [210]:
"""
TOPICS:
1. Pandas series - initialization, indexing
2. pandas dataframe - initialization, indexing
"""

'\nTOPICS:\n1. Pandas series\n2. pandas dataframe\n'

In [211]:
#pandas series

In [212]:
#pandas series from python list
mylist = [10, 20, 30]
labels = ['a', 'b', 'c']
pd_series = pd.Series(data = mylist, index = labels)
pd_series

a    10
b    20
c    30
dtype: int64

In [213]:
#access series elements by label indexing
pd_series['b']

20

In [214]:
#access series elements by integer indexing
pd_series[1]

20

In [215]:
#pandas series from numpy array 
mylist = [10, 20, 30]
my_list = np.array(mylist)
labels = ['a', 'b', 'c']
pd_series = pd.Series(data = mylist, index = labels)
pd_series

a    10
b    20
c    30
dtype: int64

In [216]:
#pandas series from dictonary
mydict = {'a':10, 'b':20, 'c':30}
pd_series = pd.Series(mydict)
pd_series

a    10
b    20
c    30
dtype: int64

In [217]:
#operations between series
s1 = pd.Series([10, 20, 30, 40], ['a', 'b', 'c', 'd'])
s2 = pd.Series([100, 200, 300, 400], ['a', 'b', 'c', 'd'])
s1+s2

a    110
b    220
c    330
d    440
dtype: int64

In [218]:
#operations between series
s1 = pd.Series([10, 20, 30, 40], ['a', 'b', 'c', 'd'])
s2 = pd.Series([100, 200, 300, 400], ['a', 'b', 'c', 'e'])
s1+s2

a    110.0
b    220.0
c    330.0
d      NaN
e      NaN
dtype: float64

In [219]:
#pandas dataframe

In [220]:
#create pandas dataframe
index = ['i', 'j', 'k']
columns = ['a', 'b', 'c', 'd']
np.random.seed(10)
mylist = np.random.randint(0, 100, (3,4))
df = pd.DataFrame(data = mylist, index = index, columns = columns)
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [221]:
#indexing dataframe elements

In [222]:
#extract series from data frame by passing column name
df['a']

i     9
j    89
k    73
Name: a, dtype: int32

In [223]:
#extract dataframe from source dataframe by passing list of column names
df[['a','c']]

    a   c
i   9  64
j  89  29
k  73  40

In [224]:
#create new column
#feature engineering technique
df['new'] = df['a'] + df['b']
df

    a   b   c   d  new
i   9  15  64  28   24
j  89  93  29   8  182
k  73   0  40  36   73

In [225]:
#filter dataframe label data
#drop a perticular column series
#df.drop operation is not inplace by default => does not change source dataframe
df.drop(labels = 'new', axis = 1)#drop across column

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [226]:
df

    a   b   c   d  new
i   9  15  64  28   24
j  89  93  29   8  182
k  73   0  40  36   73

In [227]:
df = df.drop(labels = 'new', axis = 1)
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [228]:
#handline row lables in dtaframe

In [229]:
#extract a row
df.loc['i']

a     9
b    15
c    64
d    28
Name: i, dtype: int32

In [230]:
#extract multiple rows
df.loc[['i','k']]

    a   b   c   d
i   9  15  64  28
k  73   0  40  36

In [231]:
#extrct rows using integer indexing
df.iloc[0]

a     9
b    15
c    64
d    28
Name: i, dtype: int32

In [232]:
#extract row elements using slicing notation
df.iloc[0:2]

    a   b   c   d
i   9  15  64  28
j  89  93  29   8

In [233]:
#filter a row
df.drop('i', axis = 0)

    a   b   c   d
j  89  93  29   8
k  73   0  40  36

In [234]:
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [235]:
#access a single element from dataframe
df.loc['i','b']

15

In [236]:
#access subset of dataframe
df.loc[['i','j'],['c','d']]

    c   d
i  64  28
j  29   8